package Lections.unit10_Reg.unit10_1;
public class Main {

    /*
    Регулярний вираз це текстова конструкція для пошуку або заміни підрядків у рядку тексту
    Складаються з літералів та метасимволів які утворюють шаблони для пошуку патернів у рядках

    Літерали це прості символи які потрібно знайти у рядках
    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
        Метасимволи використовуються у конструкціях для побудови складних текстових шаблонів.

    - пошук збігів з будь-яким символом, крім символа нового рядка.
    ^ - пошук збігів з початком рядка.
    $ - пошук збігів з кінцем рядка.
    * - пошук збігів з 0+ повтореннями попереднього символа або групи символів.
    + - пошук збігів з 1+ повтореннями попереднього символа або групи символів.
    ? - пошук збігів з 0 або 1 повторенням попереднього символа або групи символів.
    [] визначає набір символів. Для рядка латинських символів патерн "[aeiou]" знайде будь-яку голосну літеру.
    [^] - виконує інверсний пошук ("все крім"). Для рядка латинських символів патерн
    "[^aeiou]" знайде будь-яку приголосну літеру.

    ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
    Регулярні вирази: метасимволи
    \d - будь-яка цифра, скорочення для "[0-9]"
    \D - не цифра, скорочення для "[^0-9]"
    \s символ пропуску (пробіл, табуляція, новий рядок, вертикальна табуляція, переведення каретки, форм-feed), скорочення для "[\t\n\x0b\r\f]"
    \S символ, який не є пропуском
    \w - символ слова, скорочення для "[a-zA-Z_0-9]"
    \W - символ, який не є символом слова "[^\w]"
    \S+ - декілька символів, які не є пропусками
    \b - відповідає границі слова, де символ з набору "[a-zA-Z0-9_]" є на початку чи в кінці слова


    Регулярні вирази: метасимволи
    Регулярні вирази в Java за замовчуванням чутливі до регістру.
    "[a-z]" - збіг з будь-якої малою літерою латинського алфавіту.
    "[a-zA-Z]" - збіг з будь-якої літерою латинського алфавіту.
    "[0-9]"- збіг з будь-якою цифрою
    "{x,y}" перевірка кількості повторень у рядку, де "х" мінімальний ліміт повторень, "у" максимальний.

    Приклад виразу для перевірки мінімальної довжини рядка в 8 символів: ".{8,}", де
    "." вказує на збіг з будь-яким символом;
    "(8,}" вказує, що попередній символ (".") повинен повторюватися принаймні 8 разів.

    */


}
